from sklearn.feature_extraction.text import CountVectorizer
from sklearn.naive_bayes import MultinomialNB

texts = [
    "Купити зараз",                        # 1
    "Зустрінемося в 15:00",                # 0
    "Отримай знижку 70% вже сьогодні",    # 1
    "Як справи?",                          # 0
    "Термінова пропозиція тільки сьогодні",# 1
    "Можеш передзвонити пізніше?",         # 0
    "Пройди опитування та виграй iPhone", # 1
    "Надішли, будь ласка, файл",           # 0
    "Зароби 1000 грн за день",             # 1
    "Не забудь про зустріч завтра",        # 0
    "Твоя карта заблокована, натисни тут", # 1
    "Де ти зараз?",                        # 0
    "Отримай миттєвий кредит онлайн",      # 1
    "Скинь адресу, будь ласка",            # 0
    "Купуй вигідно, акція діє до вечора",  # 1
    "Чекаю тебе біля входу",               # 0
    "Пройди реєстрацію та отримай бонус",  # 1
    "Мама вже вдома?",                     # 0
    "Виграй подорож до Єгипту",            # 1
    "Завтра буде контрольна з математики"  # 0
]

labels = [
    1, 0, 1, 0, 1, 0, 1, 0, 1, 0,
    1, 0, 1, 0, 1, 0, 1, 0, 1, 0
]

vec = CountVectorizer()
X = vec.fit_transform(texts)
model = MultinomialNB()
model.fit(X, labels)

print("Вкажіть фразу")
text = input()

test = vec.transform([text])
print("Це спам" if model.predict(test)[0] else "Це не спам")